Revit 2027 API
ICentralLockedCallback.ShouldWaitForLockAvailability Method
 Returns whether Revit should wait and try again to acquire the lock on central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool ShouldWaitForLockAvailability()
Function ShouldWaitForLockAvailability As Boolean
bool ShouldWaitForLockAvailability()
abstract ShouldWaitForLockAvailability : unit -> bool
Return Value
Boolean
 True means wait and try again later. False means immediately give up.
See Also
Reference
ICentralLockedCallback Interface
Autodesk.Revit.DB Namespace